
{
    "time": "Current time: 2025-10-14 10:37:02",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n I am working for an insurance company that is using expert judgement for certain assumptions used in the provision process. What are the requirements for these expert judgement assumptions? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER I*\n\n* Header 3: Section 1\n\n* Header 5: Article 2\n:\n\n extract:\n\n **Expert judgement**\n\n\n1. Where insurance and reinsurance undertakings make assumptions about rules relating to the valuation of assets\nand liabilities, technical provisions, own funds, solvency capital requirements, minimum capital requirements and\ninvestment rules, these assumptions shall be based on the expertise of persons with relevant knowledge, experience and\nunderstanding of the risks inherent in the insurance or reinsurance business.\n\n\n2. Insurance and reinsurance undertakings shall, taking due account of the principle of proportionality, ensure that\ninternal users of the relevant assumptions are informed about their relevant content, their degree of reliability and their\nlimitations. For that purpose, service providers to whom functions or activities have been outsourced shall be considered\nto be internal users. \n\n\n\n### source 2 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on undertaking-specific parameters.pdf\n* Header 4: **Guideline 1 – Role of expert judgement**\n:\n\n extract:\n\n 1.12. For the purpose of determining the undertaking-specific parameters\nundertakings should be allowed to use assumptions based on expert judgement\nonly as an adjustment to existing data and not as a substitute for missing data.\n\n\n1.13. Undertakings should only use assumptions based on expert judgement if the\n\nresulting adjusted data meet the criteria set out in Article 219 of Commission\nDelegated Regulation 2015/35 to a higher degree and should demonstrate such\ncompliance upon request of the supervisory authorities. \n\n\n\n### source 3 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on the use of internal models.pdf\n* Header 4: **Guideline 19 - Documentation of assumptions setting**\n:\n\n extract:\n\n 1.45. The insurance or reinsurance undertaking should document the assumption\n\nsetting process and, in particular, the use of expert judgement, in such a\nmanner that the process is transparent.\n\n\n1.46. The insurance or reinsurance undertaking should include in the documentation\n\nthe resulting assumptions and their materiality, the experts involved, the\nintended use and the period of validity.\n\n\n1.47. The insurance or reinsurance undertaking should include the rationale for the\n\nopinion, including the information basis used, with the level of detail necessary\nto make transparent both the assumptions and the process and decisionmaking criteria used for the selection of the assumptions and disregarding other\n\nalternatives.\n\n\n1.48. The insurance or reinsurance undertaking should make sure that users of\n\nmaterial assumptions receive clear and comprehensive written information\nabout those assumptions.\n \n\n\n\n### source 4 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on the use of internal models.pdf\n* Header 4: **Guideline 17 – Governance of assumptions setting**\n:\n\n extract:\n\n 1.39. The insurance or reinsurance undertaking should ensure that all assumption\n\nsetting and the use of expert judgement in particular, follows a validated and\ndocumented process.\n\n\n1.40. The insurance or reinsurance undertaking should ensure that the assumptions\n\nare derived and used consistently over time and across the insurance or\nreinsurance undertaking and that they are fit for their intended use.\n\n\n1.41. The insurance or reinsurance undertaking should approve the assumptions at\n\nlevels of sufficient seniority according to their materiality, for most material\nassumptions up to and including the administrative, management or\nsupervisory body. \n\n\n\n### source 5 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on the use of internal models.pdf\n* Header 4: **Guideline 16 – Materiality in assumptions setting**\n:\n\n extract:\n\n 1.37. The insurance or reinsurance undertaking should set assumptions and use\n\nexpert judgment, in particular taking into account the materiality of the impact\nof the use of assumptions with respect to the following Guidelines on\nassumption setting and expert judgement.\n\n\n1.38. The insurance or reinsurance undertaking should assess materiality taking into\n\naccount both quantitative and qualitative indicators and taking into\n\nconsideration extreme losses conditions. The insurance or reinsurance\n\nundertaking should overall evaluate the indicators considered.\n \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Based on the provided sources, the requirements for using expert judgement for assumptions can be summarized into the following key areas:\n\n### Expertise and Basis\n*   Assumptions must be based on the expertise of individuals who possess relevant knowledge, experience, and a deep understanding of the risks associated with the insurance or reinsurance business (Source 1).\n\n### Governance and Process\n*   The use of expert judgement must follow a validated and documented process (Source 4).\n*   Assumptions should be derived and used consistently over time and across the entire company. They must also be fit for their intended purpose (Source 4).\n*   The assumptions must be approved at a level of seniority that corresponds to their materiality. The most material assumptions require approval from the administrative, management, or supervisory body (Source 4).\n\n### Documentation and Transparency\n*   The assumption-setting process, particularly the use of expert judgement, must be documented in a way that makes it transparent (Source 3).\n*   The documentation must include:\n    *   The final assumptions and their materiality (Source 3).\n    *   The experts who were involved (Source 3).\n    *   The intended use and the period of validity for the assumptions (Source 3).\n    *   The rationale behind the expert opinion, including the information used and the criteria for selecting the assumption over other alternatives (Source 3).\n*   Internal users, including outsourced service providers, must be informed about the content of the assumptions, their degree of reliability, and their limitations (Source 1). Users of material assumptions must receive clear and comprehensive written information about them (Source 3).\n\n### Limitations and Appropriate Use\n*   Expert judgement should be used as an **adjustment** to existing data, not as a substitute for missing data (Source 2).\n*   It should only be used if the resulting adjusted data meets the criteria in Article 219 of Commission Delegated Regulation 2015/35 to a higher degree. The company must be able to demonstrate this to supervisory authorities upon request (Source 2).\n\n### Materiality\n*   The use of expert judgement must take into account the materiality of its impact (Source 5).\n*   Materiality should be assessed using both quantitative and qualitative indicators, and it must also consider extreme loss conditions (Source 5)."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n I am working for an insurance company that is using expert judgement for certain assumptions used in the provision process. What are the requirements for these expert judgement assumptions? Can you provide a step plan on how to follow these requirements? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER I*\n\n* Header 3: Section 1\n\n* Header 5: Article 2\n:\n\n extract:\n\n **Expert judgement**\n\n\n1. Where insurance and reinsurance undertakings make assumptions about rules relating to the valuation of assets\nand liabilities, technical provisions, own funds, solvency capital requirements, minimum capital requirements and\ninvestment rules, these assumptions shall be based on the expertise of persons with relevant knowledge, experience and\nunderstanding of the risks inherent in the insurance or reinsurance business.\n\n\n2. Insurance and reinsurance undertakings shall, taking due account of the principle of proportionality, ensure that\ninternal users of the relevant assumptions are informed about their relevant content, their degree of reliability and their\nlimitations. For that purpose, service providers to whom functions or activities have been outsourced shall be considered\nto be internal users. \n\n\n\n### source 2 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on the use of internal models.pdf\n* Header 4: **Guideline 17 – Governance of assumptions setting**\n:\n\n extract:\n\n 1.39. The insurance or reinsurance undertaking should ensure that all assumption\n\nsetting and the use of expert judgement in particular, follows a validated and\ndocumented process.\n\n\n1.40. The insurance or reinsurance undertaking should ensure that the assumptions\n\nare derived and used consistently over time and across the insurance or\nreinsurance undertaking and that they are fit for their intended use.\n\n\n1.41. The insurance or reinsurance undertaking should approve the assumptions at\n\nlevels of sufficient seniority according to their materiality, for most material\nassumptions up to and including the administrative, management or\nsupervisory body. \n\n\n\n### source 3 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on undertaking-specific parameters.pdf\n* Header 4: **Guideline 1 – Role of expert judgement**\n:\n\n extract:\n\n 1.12. For the purpose of determining the undertaking-specific parameters\nundertakings should be allowed to use assumptions based on expert judgement\nonly as an adjustment to existing data and not as a substitute for missing data.\n\n\n1.13. Undertakings should only use assumptions based on expert judgement if the\n\nresulting adjusted data meet the criteria set out in Article 219 of Commission\nDelegated Regulation 2015/35 to a higher degree and should demonstrate such\ncompliance upon request of the supervisory authorities. \n\n\n\n### source 4 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on the use of internal models.pdf\n* Header 4: **Guideline 19 - Documentation of assumptions setting**\n:\n\n extract:\n\n 1.45. The insurance or reinsurance undertaking should document the assumption\n\nsetting process and, in particular, the use of expert judgement, in such a\nmanner that the process is transparent.\n\n\n1.46. The insurance or reinsurance undertaking should include in the documentation\n\nthe resulting assumptions and their materiality, the experts involved, the\nintended use and the period of validity.\n\n\n1.47. The insurance or reinsurance undertaking should include the rationale for the\n\nopinion, including the information basis used, with the level of detail necessary\nto make transparent both the assumptions and the process and decisionmaking criteria used for the selection of the assumptions and disregarding other\n\nalternatives.\n\n\n1.48. The insurance or reinsurance undertaking should make sure that users of\n\nmaterial assumptions receive clear and comprehensive written information\nabout those assumptions.\n \n\n\n\n### source 5 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on the use of internal models.pdf\n* Header 4: **Guideline 16 – Materiality in assumptions setting**\n:\n\n extract:\n\n 1.37. The insurance or reinsurance undertaking should set assumptions and use\n\nexpert judgment, in particular taking into account the materiality of the impact\nof the use of assumptions with respect to the following Guidelines on\nassumption setting and expert judgement.\n\n\n1.38. The insurance or reinsurance undertaking should assess materiality taking into\n\naccount both quantitative and qualitative indicators and taking into\n\nconsideration extreme losses conditions. The insurance or reinsurance\n\nundertaking should overall evaluate the indicators considered.\n \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Based on the provided sources, here are the requirements for using expert judgement for assumptions in the provisioning process, followed by a step-by-step plan to ensure compliance.\n\n### Requirements for Expert Judgement Assumptions\n\n1.  **Expertise-Based:** Assumptions must be grounded in the expertise of individuals with relevant knowledge, experience, and a clear understanding of the inherent risks of the business (Source 1).\n2.  **Governance and Process:**\n    *   The use of expert judgement must adhere to a validated and documented internal process (Source 2).\n    *   Assumptions must be derived and applied consistently over time and across the company, and they must be fit for their intended use (Source 2).\n    *   Approval for assumptions must come from a level of seniority that matches their materiality. The most material assumptions require approval from the administrative, management, or supervisory body (Source 2).\n3.  **Appropriate Use:** Expert judgement should be used only as an **adjustment** to existing data, not as a substitute for missing data. It is only appropriate if the adjusted data better meets the criteria in Article 219 of Commission Delegated Regulation 2015/35, and the company must be able to demonstrate this to supervisors (Source 3).\n4.  **Materiality Assessment:** The use of expert judgement must consider the materiality of its impact. This assessment should be based on both quantitative and qualitative indicators and must also take extreme loss conditions into account (Source 5).\n5.  **Documentation and Transparency:** The entire assumption-setting process must be documented transparently. This documentation must include (Source 4):\n    *   The resulting assumptions and their materiality.\n    *   The experts who were involved.\n    *   The intended use and period of validity.\n    *   A detailed rationale for the opinion, including the information basis used and the criteria for selecting the assumption over other alternatives.\n6.  **Communication:**\n    *   Internal users, which includes outsourced service providers, must be informed about the assumptions' content, reliability, and limitations (Source 1).\n    *   Users of material assumptions must receive clear and comprehensive written information about them (Source 4).\n\n---\n\n### Step-by-Step Plan for Using Expert Judgement\n\nHere is a practical step plan to follow the requirements for using expert judgement assumptions:\n\n**Step 1: Define the Need and Assess Materiality**\n*   Identify the specific assumption that requires expert judgement.\n*   Confirm that the judgement will be used to *adjust* existing data, not to replace missing data (Source 3).\n*   Conduct a materiality assessment using both quantitative and qualitative indicators, considering extreme loss scenarios, to determine the significance of the assumption (Source 5).\n\n**Step 2: Select the Expert(s)**\n*   Identify and formally engage individuals who possess the required knowledge, experience, and understanding of the specific risks related to the assumption (Source 1).\n\n**Step 3: Follow the Validated Process**\n*   Execute the company's pre-defined, validated, and documented process for setting assumptions (Source 2).\n*   The expert(s) should develop the assumption, ensuring it is fit for its intended purpose and can be applied consistently (Source 2).\n*   Justify and be prepared to demonstrate how this expert judgement improves the quality of the data in line with regulatory requirements (Source 3).\n\n**Step 4: Document the Assumption and Rationale**\n*   Create a transparent and detailed documentation package for the assumption (Source 4). This must include:\n    *   The final assumption and the outcome of the materiality assessment.\n    *   The names and roles of the experts involved.\n    *   The intended use and the period for which the assumption is valid.\n    *   A clear rationale explaining the information used, the decision-making criteria, and why other alternatives were not chosen.\n\n**Step 5: Obtain Senior Approval**\n*   Submit the assumption and its supporting documentation for formal approval.\n*   Ensure the approval is granted by the appropriate level of seniority, as determined by the materiality assessment. For the most material assumptions, this must be the administrative, management, or supervisory body (Source 2).\n\n**Step 6: Communicate to Users**\n*   Disseminate clear, comprehensive, and written information about the assumption to all internal users, including any outsourced service providers (Source 4).\n*   This communication must specify the assumption's content, its degree of reliability, and any known limitations (Source 1)."
        ]
    ]
}