
{
    "time": "Current time: 2025-10-08 13:41:51",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Mag ik voor de SCR premierisico alleen rekening houden met de premies van de komende 12 maanden? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER VI*\n\n* Header 3: Section 4\n\n* Header 4: Subsection 1\n\n* Header 5: Article 101\n:\n\n extract:\n\n **Calculation of the Solvency Capital Requirement**\n\n\n1. The Solvency Capital Requirement shall be calculated in\naccordance with paragraphs 2 to 5.\n\n\n2. The Solvency Capital Requirement shall be calculated on the\npresumption that the undertaking will pursue its business as a\ngoing concern.\n\n\n\n3. The Solvency Capital Requirement shall be calibrated so as\nto ensure that all quantifiable risks to which an insurance or rein­\nsurance undertaking is exposed are taken into account. It shall\ncover existing business, as well as the new business expected to\nbe written over the following 12 months. With respect to exist­\ning business, it shall cover only unexpected losses.\n\n\nIt shall correspond to the Value-at-Risk of the basic own funds of\nan insurance or reinsurance undertaking subject to a confidence\nlevel of 99,5 % over a one-year period.\n\n\n4. The Solvency Capital Requirement shall cover at least the\nfollowing risks:\n\n\n(a) non-life underwriting risk;\n\n\n(b) life underwriting risk; \n\n\n\n### source 2 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER V*\n\n* Header 3: Section 2\n\n* Header 5: Article 116\n:\n\n extract:\n\n 4. For all segments set out in Annex II, insurance and reinsurance undertakings may, as an alternative to the\ncalculation set out in paragraph 3 of this Article, choose to calculate the volume measure for premium risk of a\nparticular segment _s_ in accordance with the following formula:\n\n\n_V_ ð _prem,s_ Þ ¼ _P_ _s_ þ _FP_ ð _existing,s_ Þ þ _FP_ ð _future,s_ Þ\n\n\nprovided that the all of following conditions are met:\n\n\n(a) the administrative, management or supervisory body of the insurance or reinsurance undertaking has decided that\nits earned premiums in the segment _s_ during the following 12 months will not exceed _P_ _s_ ;\n\n\n(b) the insurance or reinsurance undertaking has established effective control mechanisms to ensure that the limits on\nearned premiums referred to in point (a) will be met;\n\n\n(c) the insurance or reinsurance undertaking has informed its supervisory authority about the decision referred to in\npoint (a) and the reasons for it. \n\n\n\n### source 3 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II):\n\n extract:\n\n (45) In relation to premium risk, the calculation of the capital requirement for non-life and health premium and\nreserve risk should be based on the larger of the past and the expected future earned premiums to take account\nof the uncertainty around the future earned premiums. However, where an insurance or reinsurance undertaking\ncan reliably ensure that the future earned premiums will not exceed the expected premiums, the calculation\nshould be based on the expected earned premiums only.\n\n\n(46) In order to reflect the average characteristics of life insurance obligations, the modelling of mass lapse risk in the\nSolvency Capital Requirement standard formula should be based on the assumption that the risk relating to the\noptions that a ceding insurance or reinsurance undertaking of a reinsurance contract may exercise is not material\nfor the accepting insurance or reinsurance undertaking. \n\n\n\n### source 4 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: _ANNEX XVII_\n:\n\n extract:\n\n (b) the premiums earned in segment _s_ ;\n\n\nThose aggregated losses and earned premiums shall be available separately for each accident year of the\ninsurance and reinsurance claims in segment _s_ .\n\n\n(2) The following method-specific data requirements shall apply:\n\n\n(a) the data are representative for the premium risk that the insurance or reinsurance undertaking is exposed to\nduring the following twelve months;\n\n\n(b) data are available for at least five consecutive accident years;\n\n\n(c) where the premium risk method is applied to replace the standard parameters referred to in\nArticle 218(1)(a)(i) and (c)(i), the aggregated losses and earned premiums are not adjusted for recoverable\nfrom reinsurance contracts and special purpose vehicles or reinsurance premiums;\n\n\n(d) where the premium risk method is applied to replace the standard parameters referred to in\nArticle 218(1)(a)(ii) and (c)(ii): \n\n\n\n### source 5 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER V*\n\n* Header 3: Section 2\n\n* Header 5: Article 122\n:\n\n extract:\n\n (b) _P_ _earthquake_ is an estimate of the premiums to be earned by insurance and reinsurance undertakings for each contract\nthat covers the obligations referred to in points (a) and (b) of paragraph 5 during the following 12 months: for this\npurpose premiums shall be gross, without deduction of premiums for reinsurance contracts. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte bronnen is het antwoord als volgt:\n\nNee, in de standaardberekening voor het premierisico kunt u niet zomaar alleen rekening houden met de premies van de komende 12 maanden. De berekening moet gebaseerd zijn op het hoogste bedrag van de verdiende premies uit het verleden en de verwachte verdiende premies in de toekomst, om rekening te houden met de onzekerheid hieromtrent (Source 3).\n\nDe Solvabiliteitskapitaalvereiste (SCR) moet de bestaande portefeuille dekken, evenals de nieuwe contracten die naar verwachting in de komende 12 maanden zullen worden geschreven (Source 1).\n\nEr is echter een uitzondering mogelijk. U mag voor de berekening uitsluitend uitgaan van de verwachte verdiende premies voor de komende 12 maanden als u aan de volgende voorwaarden voldoet:\n\n1.  Het bestuurs-, leidinggevend of toezichthoudend orgaan van de onderneming heeft besloten dat de verdiende premies in het betreffende segment gedurende de komende 12 maanden een bepaald bedrag ($P_s$) niet zullen overschrijden (Source 2).\n2.  De onderneming heeft doeltreffende controlemechanismen ingesteld om ervoor te zorgen dat deze limiet op de verdiende premies wordt nageleefd (Source 2).\n3.  De onderneming heeft haar toezichthoudende autoriteit geïnformeerd over dit besluit en de redenen daarvoor (Source 2).\n\nAls aan deze voorwaarden is voldaan, kan de omvangmaatstaf voor het premierisico ($V_{{(prem,s)}}$) worden berekend op basis van de verwachte premies (Source 2, 3)."
        ]
    ]
}