
{
    "time": "Current time: 2025-10-31 14:12:14",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Berekening van de SCR op groepsniveau (voor verzekeringsgroepen met meerdere dochtermaatschappijen): Hoe wordt de SCR op groepniveau berekend volgens de standaardformule en welke methoden zijn daarin toegestaan? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 1\n\n* Header 4: Subsection 4\n\n* Header 5: Article 230\n:\n\n extract:\n\n 2. The Solvency Capital Requirement at group level based on\nconsolidated data (consolidated group Solvency Capital Require­\nment) shall be calculated on the basis of either the standard for­\nmula or an approved internal model, in a manner consistent with\nthe general principles contained in Title I, Chapter VI, Section 4,\nSubsections 1 and 2 and Title I, Chapter VI, Section 4, Subsec­\ntions 1 and 3, respectively.\n\n\nThe consolidated group Solvency Capital Requirement shall have\nas a minimum the sum of the following:\n\n\n(a) the Minimum Capital Requirement as referred to in\nArticle 129 of the participating insurance or reinsurance\nundertaking;\n\n\n\n(b) the proportional share of the Minimum Capital Requirement\nof the related insurance and reinsurance undertakings.\n\n\nThat minimum shall be covered by eligible basic own funds as\ndetermined in Article 98(4). \n\n\n\n### source 2 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on undertaking-specific parameters.pdf\n* Header 4: **Guideline 11 – Scope of the group using group-specific parameters**\n:\n\n extract:\n\n 1.33. When the group Solvency Capital Requirement is calculated under method 1 or\n\nunder the combination of method 1 and method 2, the participating insurance\nor reinsurance undertaking, the insurance holding company or the mixed\nfinancial holding company should use the group specific-parameters only on\nconsolidated data calculated in accordance with Article 335 1(a),(b) and (c) of\nCommission Delegated Regulation 2015/35.\n\n\n1.34. When the group Solvency Capital Requirement is calculated under method 2,\n\nthe participating insurance or reinsurance undertaking, the insurance holding\ncompany or the mixed financial holding company should not use group-specific\n\nparameters.\n\n\n1.35. If an undertaking within the scope of group solvency calculation under method\n\n2 uses undertaking-specific parameters, then undertaking-specific parameters\nshould be included in the group Solvency Capital Requirement calculation only\nfor those undertakings which received approval from the supervisory \n\n\n\n### source 3 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE II\n\n* Header 2: *CHAPTER I*\n\n* Header 3: Section 2\n\n* Header 5: Article 336\n:\n\n extract:\n\n **Method 1: Calculation of the consolidated group Solvency Capital Requirement**\n\n\nThe consolidated group Solvency Capital Requirement shall be calculated as the sum of the following:\n\n\n(a) a Solvency Capital Requirement calculated on the basis of consolidated data referred to in Article 335(1)(a), (b)\nand (c) of this Regulation following the rules laid down in Title I, Chapter VI, Section 4 of Directive 2009/138/EC;\n\n\n(b) the proportional share of the Solvency Capital Requirement of each undertaking referred to in Article 335(1)(d) of\nthis Regulation; for a related third-country insurance or reinsurance undertaking which is not a subsidiary the\nSolvency Capital Requirement shall be calculated as if that undertaking had its head office in the Union; \n\n\n\n### source 4 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on group solvency.pdf\n* Header 4: **Guideline 12 - Contribution of a subsidiary to the group solvency capital**\n:\n\n extract:\n\n **requirement**\n\n\n1.32. When using method 1 and when the standard formula is applied, the\n\nparticipating insurance or reinsurance undertaking, the insurance holding\ncompany or the mixed financial holding company should calculate the\ncontribution of a subsidiary to the group solvency capital requirement according\n\nto Technical Annex 1.\n\n\n1.33. For insurance or reinsurance undertakings, intermediate insurance holding\n\ncompany or intermediate mixed financial holding company consolidated\naccording to Article 335 of Commission Delegated Regulation 2015/35, the\ncontribution of the individual solvency capital requirement should be calculated\ntaking into account the proportional share used for the determination of the\n\nconsolidated data.\n\n\n1.34. When the consolidated group solvency capital requirement is calculated on the \n\n\n\n### source 5 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 3\n\n* Header 5: Article 246\n:\n\n extract:\n\n Where the calculation of the solvency at the level of the group is\ncarried out in accordance with method 1, as referred to in\nArticle 230, the participating insurance or reinsurance undertak­\ning or the insurance holding company shall provide to the group\nsupervisor a proper understanding of the difference between the\nsum of the Solvency Capital Requirements of all the related insur­\nance or reinsurance undertakings of the group and the group con­\nsolidated Solvency Capital Requirement.\n\n\nWhere the participating insurance or reinsurance undertaking or\nthe insurance holding company so decides, and subject to the\nagreement of the group supervisor, it may undertake any assess­\nments required by Article 45 at the level of the group and at the\nlevel of any subsidiary in the group at the same time, and may\nproduce a single document covering all the assessments. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte documenten wordt de Solvabiliteitskapitaalvereiste (SCR) op groepsniveau berekend volgens de volgende principes en methoden:\n\nDe berekening van de SCR op groepsniveau is gebaseerd op geconsolideerde gegevens en kan worden uitgevoerd met behulp van de standaardformule of een goedgekeurd intern model (Source 1). De regelgeving staat twee hoofdmethoden toe voor de berekening:\n\n### Methode 1: Consolidatiemethode\n\nDit is de standaardmethode. De geconsolideerde SCR op groepsniveau wordt berekend als de som van de volgende twee componenten (Source 3):\n\n1.  **Een Solvabiliteitskapitaalvereiste berekend op basis van geconsolideerde gegevens**: Dit omvat de gegevens van de deelnemende verzekerings- of herverzekeringsonderneming en haar dochterondernemingen, alsof zij één enkele entiteit vormen. Deze berekening volgt de regels van de standaardformule zoals die voor een individuele onderneming gelden (Source 1, 3).\n2.  **Het pro rata aandeel van de SCR van elke verbonden onderneming die niet in de consolidatie is opgenomen**: Voor een verbonden verzekerings- of herverzekeringsonderneming uit een derde land die geen dochteronderneming is, wordt de SCR berekend alsof die onderneming haar hoofdkantoor in de Unie heeft (Source 3).\n\nWanneer Methode 1 wordt gebruikt, moet de groep inzicht kunnen geven in het verschil tussen de som van de SCR's van alle individuele verbonden ondernemingen en de geconsolideerde SCR van de groep. Dit verschil ontstaat doorgaans door diversificatie-effecten binnen de groep (Source 5).\n\n### Methode 2: Deductie- en aggregatiemethode\n\nDe bronnen vermelden het bestaan van een \"Methode 2\", maar geven geen details over de berekening ervan. Ze specificeren wel dat bij gebruik van Methode 2 geen groepsspecifieke parameters mogen worden gebruikt, tenzij een individuele onderneming binnen de groep goedkeuring heeft voor het gebruik van ondernemingsspecifieke parameters (Source 2).\n\n### Minimumvereiste voor de Groeps-SCR\n\nOngeacht de gebruikte methode, mag de geconsolideerde SCR op groepsniveau niet lager zijn dan de som van (Source 1):\n\na) Het Minimumkapitaalvereiste (MCR) van de deelnemende verzekerings- of herverzekeringsonderneming.\nb) Het pro rata aandeel van het MCR van de verbonden verzekerings- en herverzekeringsondernemingen.\n\nDit minimum moet gedekt worden door in aanmerking komend tier 1-kernvermogen (eligible basic own funds) (Source 1)."
        ]
    ]
}