
{
    "time": "Current time: 2025-10-31 14:15:42",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Berekening van de SCR op groepsniveau (voor verzekeringsgroepen met meerdere dochtermaatschappijen): Hoe wordt de SCR op groepniveau berekend volgens de standaardformule en welke methoden zijn daarin toegestaan? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 1\n\n* Header 4: Subsection 4\n\n* Header 5: Article 230\n:\n\n extract:\n\n 2. The Solvency Capital Requirement at group level based on\nconsolidated data (consolidated group Solvency Capital Require­\nment) shall be calculated on the basis of either the standard for­\nmula or an approved internal model, in a manner consistent with\nthe general principles contained in Title I, Chapter VI, Section 4,\nSubsections 1 and 2 and Title I, Chapter VI, Section 4, Subsec­\ntions 1 and 3, respectively.\n\n\nThe consolidated group Solvency Capital Requirement shall have\nas a minimum the sum of the following:\n\n\n(a) the Minimum Capital Requirement as referred to in\nArticle 129 of the participating insurance or reinsurance\nundertaking;\n\n\n\n(b) the proportional share of the Minimum Capital Requirement\nof the related insurance and reinsurance undertakings.\n\n\nThat minimum shall be covered by eligible basic own funds as\ndetermined in Article 98(4). \n\n\n\n### source 2 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on undertaking-specific parameters.pdf\n* Header 4: **Guideline 11 – Scope of the group using group-specific parameters**\n:\n\n extract:\n\n 1.33. When the group Solvency Capital Requirement is calculated under method 1 or\n\nunder the combination of method 1 and method 2, the participating insurance\nor reinsurance undertaking, the insurance holding company or the mixed\nfinancial holding company should use the group specific-parameters only on\nconsolidated data calculated in accordance with Article 335 1(a),(b) and (c) of\nCommission Delegated Regulation 2015/35.\n\n\n1.34. When the group Solvency Capital Requirement is calculated under method 2,\n\nthe participating insurance or reinsurance undertaking, the insurance holding\ncompany or the mixed financial holding company should not use group-specific\n\nparameters.\n\n\n1.35. If an undertaking within the scope of group solvency calculation under method\n\n2 uses undertaking-specific parameters, then undertaking-specific parameters\nshould be included in the group Solvency Capital Requirement calculation only\nfor those undertakings which received approval from the supervisory \n\n\n\n### source 3 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE II\n\n* Header 2: *CHAPTER I*\n\n* Header 3: Section 2\n\n* Header 5: Article 336\n:\n\n extract:\n\n **Method 1: Calculation of the consolidated group Solvency Capital Requirement**\n\n\nThe consolidated group Solvency Capital Requirement shall be calculated as the sum of the following:\n\n\n(a) a Solvency Capital Requirement calculated on the basis of consolidated data referred to in Article 335(1)(a), (b)\nand (c) of this Regulation following the rules laid down in Title I, Chapter VI, Section 4 of Directive 2009/138/EC;\n\n\n(b) the proportional share of the Solvency Capital Requirement of each undertaking referred to in Article 335(1)(d) of\nthis Regulation; for a related third-country insurance or reinsurance undertaking which is not a subsidiary the\nSolvency Capital Requirement shall be calculated as if that undertaking had its head office in the Union; \n\n\n\n### source 4 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on group solvency.pdf\n* Header 4: **Guideline 12 - Contribution of a subsidiary to the group solvency capital**\n:\n\n extract:\n\n **requirement**\n\n\n1.32. When using method 1 and when the standard formula is applied, the\n\nparticipating insurance or reinsurance undertaking, the insurance holding\ncompany or the mixed financial holding company should calculate the\ncontribution of a subsidiary to the group solvency capital requirement according\n\nto Technical Annex 1.\n\n\n1.33. For insurance or reinsurance undertakings, intermediate insurance holding\n\ncompany or intermediate mixed financial holding company consolidated\naccording to Article 335 of Commission Delegated Regulation 2015/35, the\ncontribution of the individual solvency capital requirement should be calculated\ntaking into account the proportional share used for the determination of the\n\nconsolidated data.\n\n\n1.34. When the consolidated group solvency capital requirement is calculated on the \n\n\n\n### source 5 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 3\n\n* Header 5: Article 246\n:\n\n extract:\n\n Where the calculation of the solvency at the level of the group is\ncarried out in accordance with method 1, as referred to in\nArticle 230, the participating insurance or reinsurance undertak­\ning or the insurance holding company shall provide to the group\nsupervisor a proper understanding of the difference between the\nsum of the Solvency Capital Requirements of all the related insur­\nance or reinsurance undertakings of the group and the group con­\nsolidated Solvency Capital Requirement.\n\n\nWhere the participating insurance or reinsurance undertaking or\nthe insurance holding company so decides, and subject to the\nagreement of the group supervisor, it may undertake any assess­\nments required by Article 45 at the level of the group and at the\nlevel of any subsidiary in the group at the same time, and may\nproduce a single document covering all the assessments. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte documenten wordt de Solvabiliteitskapitaalvereiste (SCR) op groepsniveau berekend volgens de volgende principes en methoden:\n\nDe berekening van de SCR op groepsniveau is gebaseerd op geconsolideerde gegevens en kan worden uitgevoerd met behulp van de standaardformule of een goedgekeurd intern model (Source 1). De regelgeving staat twee hoofdmethoden toe voor de berekening:\n\n### Methode 1: Consolidatiemethode\n\nDit is de standaardmethode. De geconsolideerde SCR op groepsniveau wordt berekend als de som van de volgende twee componenten (Source 3):\n\n1.  **Een Solvabiliteitskapitaalvereiste berekend op basis van geconsolideerde gegevens**: Dit omvat de gegevens van de deelnemende verzekerings- of herverzekeringsonderneming en haar dochterondernemingen, alsof zij één enkele entiteit vormen. Deze berekening volgt de regels van de standaardformule zoals die voor een individuele onderneming gelden (Source 1, 3).\n2.  **Het pro rata aandeel van de SCR van elke verbonden onderneming die niet in de consolidatie is opgenomen**: Voor een verbonden verzekerings- of herverzekeringsonderneming uit een derde land die geen dochteronderneming is, wordt de SCR berekend alsof die onderneming haar hoofdkantoor in de Unie heeft (Source 3).\n\nWanneer Methode 1 wordt gebruikt, moet de groep inzicht kunnen geven in het verschil tussen de som van de SCR's van alle individuele verbonden ondernemingen en de geconsolideerde SCR van de groep. Dit verschil ontstaat doorgaans door diversificatie-effecten binnen de groep (Source 5).\n\n### Methode 2: Deductie- en aggregatiemethode\n\nDe bronnen vermelden het bestaan van een \"Methode 2\", maar geven geen details over de berekening ervan. Ze specificeren wel dat bij gebruik van Methode 2 geen groepsspecifieke parameters mogen worden gebruikt, tenzij een individuele onderneming binnen de groep goedkeuring heeft voor het gebruik van ondernemingsspecifieke parameters (Source 2).\n\n### Minimumvereiste voor de Groeps-SCR\n\nOngeacht de gebruikte methode, mag de geconsolideerde SCR op groepsniveau niet lager zijn dan de som van (Source 1):\n\na) Het Minimumkapitaalvereiste (MCR) van de deelnemende verzekerings- of herverzekeringsonderneming.\nb) Het pro rata aandeel van het MCR van de verbonden verzekerings- en herverzekeringsondernemingen.\n\nDit minimum moet gedekt worden door in aanmerking komend tier 1-kernvermogen (eligible basic own funds) (Source 1)."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Kan je me de standaardformule om de SCR op groepsniveau te berekenen geven? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 1\n\n* Header 4: Subsection 4\n\n* Header 5: Article 230\n:\n\n extract:\n\n 2. The Solvency Capital Requirement at group level based on\nconsolidated data (consolidated group Solvency Capital Require­\nment) shall be calculated on the basis of either the standard for­\nmula or an approved internal model, in a manner consistent with\nthe general principles contained in Title I, Chapter VI, Section 4,\nSubsections 1 and 2 and Title I, Chapter VI, Section 4, Subsec­\ntions 1 and 3, respectively.\n\n\nThe consolidated group Solvency Capital Requirement shall have\nas a minimum the sum of the following:\n\n\n(a) the Minimum Capital Requirement as referred to in\nArticle 129 of the participating insurance or reinsurance\nundertaking;\n\n\n\n(b) the proportional share of the Minimum Capital Requirement\nof the related insurance and reinsurance undertakings.\n\n\nThat minimum shall be covered by eligible basic own funds as\ndetermined in Article 98(4). \n\n\n\n### source 2 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: _ANNEX IV_\n:\n\n extract:\n\n **SOLVENCY CAPITAL REQUIREMENT (SCR) STANDARD FORMULA**\n\n\n1. **Calculation of the Basic Solvency Capital Requirement**\n\n\nThe Basic Solvency Capital Requirement set out in Article 104(1) shall be equal to the following:\n\n$$\n\\text{{Basic SCR}} = \\sqrt{{\\sum_{{i,j}} \\text{{Corr}}_{{i,j}} \\times \\text{{SCR}}_{{i}} \\times \\text{{SCR}}_{{j}}}}\n$$\n\n\nwhere SCR i denotes the risk module i and SCR j denotes the risk module j, and where ‘i,j’ means that the sum of the dif­\nferent terms should cover all possible combinations of i and j. In the calculation, SCR i and SCR j are replaced by the\nfollowing:\n\n\n— SCR non-life denotes the non-life underwriting risk module,\n\n\n— SCR life denotes the life underwriting risk module,\n\n\n— SCR health denotes the health underwriting risk module,\n\n\n— SCR market denotes the market risk module,\n\n\n— SCR default denotes the counterparty default risk module,\n\n\nThe factor Corr i,j denotes the item set out in row i and in column j of the following correlation matrix:\n\n\n\n\n<image>\nA header row for a table or matrix with row index 'i' and column index 'j'. The columns are labeled Market, Default, Life, Health, and Non-life, likely representing different risk categories in finance or insurance.\ni\nj\nMarket\nDefault\nLife\nHealth\nNon-life\n</image>\n\n\n\n\n\n\nMarket 1 0,25 0,25 0,25 0,25\n\n\nDefault 0,25 1 0,25 0,25 0,5 \n\n\n\n### source 3 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on group solvency.pdf\n* Header 4: **Guideline 23 – Treatment of group specific risks**\n:\n\n extract:\n\n 1.58. The participating insurance or reinsurance undertaking, the insurance holding\n\ncompany or the mixed financial holding company should calculate the group\nsolvency capital requirement taking into account all quantifiable, material\nspecific risks existing at group level, which may impact the solvency and\nfinancial position of the group. If the group specific risks are material, the group\nshould use group-specific parameters or a partial internal model for the\ncalculation of the solvency capital requirement corresponding to the groupspecific risks.\n\n\n1.59. These risks are:\n\n\n(a) the risks which are also present at individual level, but whose impact is\n\nsignificantly different (which behave in a different way) at group level; or\n\n\n(b) the risks only present at group level.\n\n\n1.60. The group solvency capital requirement for the quantifiable part of these risks\n\n\nshould be calculated as follows:\n\n\n(a) in the case described in (a) by applying different calibrations to the \n\n\n\n### source 4 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE II\n\n* Header 2: *CHAPTER I*\n\n* Header 3: Section 1\n\n* Header 5: Article 330\n:\n\n extract:\n\n (a) where the consolidated group Solvency Capital Requirement is calculated, in relation to that related undertaking, on\nthe basis of the standard formula, the proportional share of the Solvency Capital Requirement of that related\nundertaking multiplied by a percentage corresponding to the proportion that the diversified component of the\nconsolidated group Solvency Capital Requirement, as laid down in Article 336 (a), bears to the sum of the Solvency\nCapital Requirements of each of the undertakings included in the calculation of that diversified component of the\nconsolidated group Solvency Capital Requirement; \n\n\n\n### source 5 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 1\n\n* Header 4: Subsection 4\n\n* Header 5: Article 233\n:\n\n extract:\n\n 3. The aggregated group Solvency Capital Requirement is the\nsum of the following:\n\n\n(a) the Solvency Capital Requirement of the participating insur­\nance or reinsurance undertaking;\n\n\n(b) the proportional share of the Solvency Capital Requirement\nof the related insurance or reinsurance undertakings. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte documenten is de kern van de standaardformule voor het berekenen van de Solvabiliteitskapitaalvereiste (SCR) de formule voor de **Basis Solvabiliteitskapitaalvereiste (Basic SCR)**. Deze formule wordt toegepast op de geconsolideerde gegevens van de groep (Source 1).\n\nDe formule voor de Basic SCR is als volgt (Source 2):\n\n$$\n\\text{{Basic SCR}} = \\sqrt{{\\sum_{{i,j}} \\text{{Corr}}_{{i,j}} \\times \\text{{SCR}}_{{i}} \\times \\text{{SCR}}_{{j}}}}\n$$\n\nIn deze formule betekenen de componenten het volgende:\n\n*   **SCR<sub>i</sub>** en **SCR<sub>j</sub>** staan voor de kapitaalvereisten voor de verschillende risicomodules. De belangrijkste modules zijn (Source 2):\n    *   SCR<sub>non-life</sub>: het verzekeringstechnisch risico niet-leven\n    *   SCR<sub>life</sub>: het verzekeringstechnisch risico leven\n    *   SCR<sub>health</sub>: het verzekeringstechnisch risico ziekte\n    *   SCR<sub>market</sub>: het marktrisico\n    *   SCR<sub>default</sub>: het tegenpartijrisico (wanbetalingsrisico)\n*   **Corr<sub>i,j</sub>** is de correlatiefactor tussen risicomodule *i* en risicomodule *j*, zoals gespecificeerd in een vaste correlatiematrix. Deze factor houdt rekening met de diversificatie-effecten tussen de verschillende risico's (Source 2).\n\n### Belangrijke overwegingen op groepsniveau\n\n*   **Toepassing op geconsolideerde data**: Bij gebruik van Methode 1 (de consolidatiemethode) wordt deze formule toegepast op de geconsolideerde balans en risicoprofiel van de groep, alsof het één enkele onderneming is (Source 1).\n*   **Groepsspecifieke risico's**: De berekening moet rekening houden met alle kwantificeerbare, materiële risico's die specifiek op groepsniveau bestaan. Dit kunnen risico's zijn die op individueel niveau anders uitpakken of risico's die alleen op groepsniveau bestaan (Source 3).\n*   **Aggregatiemethode (Methode 2)**: Als alternatief voor de consolidatiemethode kan de geaggregeerde groeps-SCR worden berekend. Dit is een directe som van de SCR van de deelnemende onderneming en het pro rata aandeel van de SCR's van de verbonden ondernemingen. Deze methode houdt minder rekening met diversificatie-effecten op groepsniveau (Source 5)."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Kan je een voorbeeld geven van een berekening op basis van methode 1? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 1\n\n* Header 4: Subsection 4\n\n* Header 5: Article 230\n:\n\n extract:\n\n **Method 1 (Default method): Accounting**\n**consolidation-based method**\n\n\n1. The calculation of the group solvency of the participating\ninsurance or reinsurance undertaking shall be carried out on the\nbasis of the consolidated accounts.\n\n\nThe group solvency of the participating insurance or reinsurance\nundertaking is the difference between the following:\n\n\n(a) the own funds eligible to cover the Solvency Capital Require­\nment, calculated on the basis of consolidated data;\n\n\n(b) the Solvency Capital Requirement at group level calculated\non the basis of consolidated data.\n\n\nThe rules laid down in Title I, Chapter VI, Section 3, Subsec­\ntions 1, 2 and 3 and in Title I, Chapter VI, Section 4, Subsec­\ntions 1, 2 and 3 shall apply for the calculation of the own funds\neligible for the Solvency Capital Requirement and of the Solvency\nCapital Requirement at group level based on consolidated data. \n\n\n\n### source 2 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on undertaking-specific parameters.pdf\n* Header 4: **Guideline 11 – Scope of the group using group-specific parameters**\n:\n\n extract:\n\n 1.33. When the group Solvency Capital Requirement is calculated under method 1 or\n\nunder the combination of method 1 and method 2, the participating insurance\nor reinsurance undertaking, the insurance holding company or the mixed\nfinancial holding company should use the group specific-parameters only on\nconsolidated data calculated in accordance with Article 335 1(a),(b) and (c) of\nCommission Delegated Regulation 2015/35.\n\n\n1.34. When the group Solvency Capital Requirement is calculated under method 2,\n\nthe participating insurance or reinsurance undertaking, the insurance holding\ncompany or the mixed financial holding company should not use group-specific\n\nparameters.\n\n\n1.35. If an undertaking within the scope of group solvency calculation under method\n\n2 uses undertaking-specific parameters, then undertaking-specific parameters\nshould be included in the group Solvency Capital Requirement calculation only\nfor those undertakings which received approval from the supervisory \n\n\n\n### source 3 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II):\n\n extract:\n\n (124) Article 220 of Directive 2009/138/EC requires the calculation of the solvency at the level of the group to be\ncarried out in accordance with method 1 (accounting consolidation-based method), unless its exclusive\napplication would not be appropriate. The group supervisor should, when assessing whether method 2\n(deduction and aggregation method) should be used instead of — or in combination with — method 1, consider\na number of harmonised relevant elements. One such element is whether the use of method 1 would be overly\nburdensome, and the nature, scale and complexity of the risks of the group are such that the use of method 2\n\nwould not materially affect the results of the group solvency calculation. In ascertaining, for these purposes,\nwhether the use of method 2 would materially affect the results of the group solvency calculation, method 2\nshould be compared with method 1 using the aggregated group eligible own funds and the aggregated group \n\n\n\n### source 4 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE II\n\n* Header 2: *CHAPTER I*\n\n* Header 3: Section 2\n\n* Header 5: Article 335\n:\n\n extract:\n\n **Method 1: determination of consolidated data**\n\n\n1. Consolidated data for the calculation of group solvency according to method 1 shall consist of all of the following:\n\n\n(a) full consolidation of data of all the insurance or reinsurance undertakings, third-country insurance or reinsurance\nundertakings, insurance holding companies, mixed financial holding companies and ancillary services undertakings\nwhich are subsidiaries of the parent undertaking;\n\n\n(b) full consolidation of data of special purpose vehicles to which the participating undertaking or one of its subsidiaries\nhas transferred risk and which are not excluded from the scope of the group solvency calculation pursuant to\nArticle 329(3); \n\n\n\n### source 5 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE III\n\n* Header 2: *CHAPTER II*\n\n* Header 3: Section 1\n\n* Header 4: Subsection 2\n\n* Header 5: Article 220\n:\n\n extract:\n\n **Choice of method**\n\n\n1. The calculation of the solvency at the level of the group of\nthe insurance and reinsurance undertakings referred to in\nArticle 213(2)(a) shall be carried out in accordance with the tech­\nnical principles and one of the methods set out in Articles 221\nto 233.\n\n11.72.2009 EN\n\n\n\nOfficial Journ al of the E uropean Un ion L 335/85\n\n\n\n2. Member States shall provide that the calculation of the sol­\nvency at the level of the group of insurance and reinsurance\nundertakings referred to in Article 213(2)(a) shall be carried out\nin accordance with method 1, which is laid down in Articles 230\nto 232. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte bronnen kan ik een vereenvoudigd, illustratief voorbeeld geven van hoe de berekening volgens Methode 1 in zijn werk gaat. De bronnen zelf bevatten geen numeriek voorbeeld, maar ze beschrijven de principes die we kunnen gebruiken om er een te construeren.\n\nMethode 1 is de standaardmethode en wordt de \"accounting consolidation-based method\" genoemd (Source 1, 3). Dit betekent dat de berekening wordt uitgevoerd op basis van de geconsolideerde jaarrekening, alsof de hele groep één enkele entiteit is (Source 1, 4).\n\n### Fictief Voorbeeld: Verzekeringsgroep \"Groep Alfa\"\n\nStel, Groep Alfa bestaat uit:\n*   **Moedermaatschappij A**: Een holding.\n*   **Dochter B**: Een levensverzekeraar.\n*   **Dochter C**: Een schadeverzekeraar.\n\nVoor de eenvoud gaan we ervan uit dat de enige risico's marktrisico, levenrisico en schadeverzekeringsrisico zijn.\n\n#### Stap 1: Bepaal de risicoblootstellingen op individueel niveau\n\nNa analyse hebben de dochterondernemingen de volgende kapitaalvereisten voor hun risico's (los van elkaar berekend):\n*   **Dochter B (Leven)**:\n    *   SCR<sub>market</sub> = 50 miljoen\n    *   SCR<sub>life</sub> = 100 miljoen\n    *   SCR<sub>non-life</sub> = 0\n*   **Dochter C (Schade)**:\n    *   SCR<sub>market</sub> = 40 miljoen\n    *   SCR<sub>life</sub> = 0\n    *   SCR<sub>non-life</sub> = 80 miljoen\n\nAls je de SCR's van de dochters simpelweg zou optellen (wat de basis is van Methode 2, de deductie- en aggregatiemethode), zou je een veel hoger getal krijgen omdat je geen rekening houdt met diversificatie tussen de entiteiten.\n\n#### Stap 2: Consolideer de gegevens (Kern van Methode 1)\n\nVolgens Methode 1 worden de gegevens van de dochterondernemingen volledig geconsolideerd (Source 4). We behandelen Groep Alfa als één grote verzekeraar en tellen de kapitaalvereisten per risicomodule bij elkaar op:\n\n*   **Geconsolideerde SCR<sub>market</sub>**: 50 (van B) + 40 (van C) = **90 miljoen**\n*   **Geconsolideerde SCR<sub>life</sub>**: 100 (van B) + 0 (van C) = **100 miljoen**\n*   **Geconsolideerde SCR<sub>non-life</sub>**: 0 (van B) + 80 (van C) = **80 miljoen**\n\n#### Stap 3: Bereken de geconsolideerde Basis SCR met de standaardformule\n\nNu passen we de standaardformule voor de Basis SCR toe op deze geconsolideerde cijfers. De formule houdt rekening met de correlatie (en dus diversificatie) tussen de verschillende risicomodules.\n\nDe formule is:\n$$\n\\text{{Basic SCR}} = \\sqrt{{\\sum_{{i,j}} \\text{{Corr}}_{{i,j}} \\times \\text{{SCR}}_{{i}} \\times \\text{{SCR}}_{{j}}}}\n$$\n\nMet de standaard correlatiewaarden (bijv. 0,25 tussen Leven en Schade, 0,25 tussen Markt en Leven, etc.), ziet de berekening er (vereenvoudigd) als volgt uit:\n\n$$\n\\text{{SCR}}_\\text{{Groep Alfa}} = \\sqrt{{\n\\begin{{pmatrix}}\n\\text{{SCR}}_\\text{{market}}^2 + \\text{{SCR}}_\\text{{life}}^2 + \\text{{SCR}}_\\text{{non-life}}^2 \\\\\n+ 2 \\times 0.25 \\times \\text{{SCR}}_\\text{{market}} \\times \\text{{SCR}}_\\text{{life}} \\\\\n+ 2 \\times 0.25 \\times \\text{{SCR}}_\\text{{market}} \\times \\text{{SCR}}_\\text{{non-life}} \\\\\n+ 2 \\times 0.25 \\times \\text{{SCR}}_\\text{{life}} \\times \\text{{SCR}}_\\text{{non-life}}\n\\end{{pmatrix}}\n}}\n$$\n\nInvullen van de geconsolideerde waarden:\n\n$$\n\\text{{SCR}}_\\text{{Groep Alfa}} = \\sqrt{{\n\\begin{{pmatrix}}\n90^2 + 100^2 + 80^2 \\\\\n+ 2 \\times 0.25 \\times 90 \\times 100 \\\\\n+ 2 \\times 0.25 \\times 90 \\times 80 \\\\\n+ 2 \\times 0.25 \\times 100 \\times 80\n\\end{{pmatrix}}\n}}\n$$\n\n$$\n\\text{{SCR}}_\\text{{Groep Alfa}} = \\sqrt{{\n\\begin{{pmatrix}}\n8100 + 10000 + 6400 \\\\\n+ 4500 \\\\\n+ 3600 \\\\\n+ 4000\n\\end{{pmatrix}}\n}}\n$$\n\n$$\n\\text{{SCR}}_\\text{{Groep Alfa}} = \\sqrt{{36600}} \\approx \\textbf{{191.3 miljoen}}\n$$\n\n### Conclusie van het voorbeeld\n\nDe berekende SCR op groepsniveau is **191.3 miljoen**. Dit is aanzienlijk lager dan de simpele som van de individuele SCR's van de dochterondernemingen zou zijn. Dit verschil is het **diversificatievoordeel**. Methode 1 erkent dat het onwaarschijnlijk is dat de slechtst denkbare scenario's voor de leven-, schade- en marktactiviteiten zich allemaal tegelijkertijd voordoen. Omdat de berekening plaatsvindt op basis van geconsolideerde data, wordt dit voordeel direct meegenomen in de berekening van de groeps-SCR (Source 1)."
        ]
    ]
}