
{
    "time": "Current time: 2025-10-09 13:23:39",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Wat is er vastgelegd over Solvency II basic \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER VI*\n\n* Header 3: Section 4\n\n* Header 4: Subsection 2\n\n* Header 5: Article 104\n:\n\n extract:\n\n **Design of the Basic Solvency Capital Requirement**\n\n\n1. The Basic Solvency Capital Requirement shall comprise\nindividual risk modules, which are aggregated in accordance with\npoint (1) of Annex IV.\n\n\nIt shall consist of at least the following risk modules:\n\n\n(a) non-life underwriting risk;\n\n\n(b) life underwriting risk;\n\n\n(c) health underwriting risk;\n\n\n(d) market risk;\n\n\n(e) counterparty default risk.\n\n\n2. For the purposes of points (a), (b) and (c) of paragraph 1,\ninsurance or reinsurance operations shall be allocated to the\nunderwriting risk module that best reflects the technical nature of\nthe underlying risks.\n\n\n3. The correlation coefficients for the aggregation of the risk\nmodules referred to in paragraph 1, as well as the calibration of\nthe capital requirements for each risk module, shall result in an\noverall Solvency Capital Requirement which complies with the\nprinciples set out in Article 101. \n\n\n\n### source 2 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER IX*\n\n* Header 3: Section 1\n\n* Header 5: Article 166\n:\n\n extract:\n\n 3. The eligible amount of basic own funds shall not be less\nthan half of the absolute floor required under Article 129(1)(d).\n\n\nThe deposit lodged in accordance with Article 162(2)(e) shall be\ncounted towards such eligible basic own funds to cover the Mini­\nmum Capital Requirement.\n\n\n4. The assets representing the Solvency Capital Requirement\nmust be kept within the Member State where the activities are\npursued up to the amount of the Minimum Capital Requirement\nand the excess within the Community.\n\n11.72.2009 EN\n\n\n\nOfficial Journ al of the E uropean Un ion L 335/71 \n\n\n\n### source 3 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER IV*\n\n* Header 3: Section 2\n\n* Header 5: Article 71\n:\n\n extract:\n\n (b) the basic own-fund item does not include features which may cause the insolvency of the insurance or reinsurance\nundertaking or may accelerate the process of the undertaking becoming insolvent;\n\n\n(c) the basic own fund item is immediately available to absorb losses;\n\n\n(d) the basic own-fund item absorbs losses at least once there is non-compliance with the Solvency Capital\nRequirement and does not hinder the recapitalisation of the insurance or reinsurance undertaking;\n\n\n(e) the basic own-fund item, in the case of items referred to in points (a)(iii) and (v) and point (b) of Article 69,\npossesses one of the following principal loss absorbency mechanisms to be triggered at the trigger event specified in\nparagraph 8:\n\n\n(i) the nominal or principal amount of the basic own-fund item is written down as set out in paragraph 5;\n\n\n(ii) the basic own-fund item automatically converts into a basic own-fund item listed in point (a)(i) or (ii) of\nArticle 69 as set out in paragraph 6; \n\n\n\n### source 4 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER V*\n\n* Header 3: Section 9\n\n* Header 5: Article 206\n:\n\n extract:\n\n 2. The net Basic Solvency Capital Requirement shall be calculated in accordance with Section 1, Subsection 1 to 7 of\nChapter V with all the following modifications:\n\n\n(a) where the calculation of a module or sub-module of the Basic Solvency Capital Requirement is based on the impact\nof a scenario on the basic own funds of insurance and reinsurance undertakings, the scenario can change the value\nof the future discretionary benefits included in technical provisions; \n\n\n\n### source 5 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on Classification of Own Funds.pdf\n* Header 4: **Guideline 23 - Supporting evidence**\n:\n\n extract:\n\n 1.81. The undertaking should provide a description of how the criteria in Articles 93\n\nand 94 of Solvency II and the features determining classification set out in\nArticles 71, 73 and 77 of Commission Delegated Regulation 2015/35 have been\nsatisfied including how the item will contribute to the undertaking’s existing\ncapital structure, and how the item may enable the undertaking to meet its\nexisting or future capital requirements.\n\n\n1.82. The undertaking should provide a description of the basic own-fund item,\n\nsufficient to allow the supervisory authority to conclude on the loss absorbing\ncapacity of the item including the contractual terms of the arrangement\ngoverning the own-fund item and the terms of any connected arrangement\ntogether with evidence that any counterparty, where relevant, has entered into\nthe contract and any connected arrangement and evidence that the contract\nand any connected arrangement are legally binding and enforceable in all\nrelevant jurisdictions. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte documenten is het volgende vastgelegd over de \"basic\" concepten binnen Solvency II:\n\n### Basic Solvency Capital Requirement (Basis-solvabiliteitskapitaalvereiste)\n\nHet Basis-solvabiliteitskapitaalvereiste (Basic Solvency Capital Requirement) is een kernonderdeel van de kapitaalvereisten en wordt als volgt ontworpen en berekend:\n\n*   **Samenstelling**: Het bestaat uit individuele risicomodules die worden samengevoegd (Source 1).\n*   **Risicomodules**: Het omvat ten minste de volgende risicomodules (Source 1):\n    *   Niet-levensverzekeringstechnisch risico (non-life underwriting risk)\n    *   Levensverzekeringstechnisch risico (life underwriting risk)\n    *   Ziekteverzekeringstechnisch risico (health underwriting risk)\n    *   Marktrisico\n    *   Wanbetalingsrisico van tegenpartijen (counterparty default risk)\n*   **Aggregatie**: De correlatiecoëfficiënten voor de aggregatie van deze modules en de kalibratie van de kapitaalvereisten voor elke module moeten resulteren in een algemeen Solvabiliteitskapitaalvereiste dat voldoet aan de principes van Artikel 101 (Source 1).\n*   **Berekening**: Het netto Basis-solvabiliteitskapitaalvereiste wordt berekend volgens specifieke methoden, waarbij een belangrijke aanpassing is dat wanneer de berekening gebaseerd is op de impact van een scenario op het basis eigen vermogen, dit scenario de waarde van toekomstige discretionaire winstdelingen in de technische voorzieningen kan wijzigen (Source 4).\n\n### Basic Own Funds (Basis eigen vermogen)\n\nHet basis eigen vermogen (basic own funds) vormt de kern van het kapitaal van een verzekeraar en moet aan strikte voorwaarden voldoen:\n\n*   **Kenmerken**: Een basis eigen vermogensbestanddeel moet aan de volgende criteria voldoen (Source 3):\n    *   Het mag geen kenmerken bevatten die de insolvabiliteit van de onderneming kunnen veroorzaken of versnellen.\n    *   Het moet onmiddellijk beschikbaar zijn om verliezen op te vangen.\n    *   Het moet verliezen absorberen zodra niet meer aan het Solvabiliteitskapitaalvereiste wordt voldaan en mag de herkapitalisatie niet belemmeren.\n    *   Het moet een mechanisme voor verliesabsorptie bezitten, zoals afschrijving van de nominale waarde of automatische omzetting in een ander type basis eigen vermogen (Source 3).\n*   **Minimumbedrag**: Het in aanmerking komende bedrag van het basis eigen vermogen mag niet minder zijn dan de helft van de absolute ondergrens die vereist is voor het Minimumkapitaalvereiste (MCR) (Source 2).\n*   **Documentatie**: De onderneming moet een beschrijving van het basis eigen vermogensbestanddeel verstrekken aan de toezichthoudende autoriteit. Deze beschrijving moet voldoende zijn om de autoriteit in staat te stellen de verliesabsorberende capaciteit van het item te beoordelen, inclusief contractuele voorwaarden en bewijs van juridische afdwingbaarheid (Source 5)."
        ]
    ]
}