
{
    "time": "Current time: 2025-10-10 14:55:00",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n What is solvency II? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on health catastrophe risk sub-module.pdf\n* Header 4: Guidelines relate to Article 105 (4) of Directive 2009/138/EC of the European\n:\n\n extract:\n\n Parliament and of the Council of 25 November 2009 on the taking-up and\npursuit of the business of Insurance and Reinsurance (hereafter, Solvency II) [2],\nas well as to Articles 160 to 163 and Annex VI of Commission Delegated\nRegulation (EU) 2015/35 of 10 October 2014 supplementing Directive/EC (hereafter, Commission Delegated Regulation 2015/35) [3] .\n\n\n1.2. These Guidelines are addressed to supervisory authorities under Solvency II.\n\n\n1.3. These Guidelines aim at facilitating convergent practices across Member States\nand at helping undertakings to appropriately identify and compute the\nquantities involved in the calculation of the health catastrophe capital\nrequirement in different possible cases and situations.\n\n\n1.4. The calculations for the determination of the capital requirement for the health\ncatastrophe risk sub-module should be consistent with the design and\ncalibration of the underlying scenarios. \n\n\n\n### source 2 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on undertaking-specific parameters.pdf:\n\n extract:\n\n 1.2. The Guidelines relate to Article 104(7), 110, 111, 230, 248(2) of Directive/EU of the European Parliament and of the Council of 25 November\n2009 on the taking up and pursuit of the business of Insurance and Reinsurance\n(hereinafter “Solvency II”) [2] as well as to Articles 218, 219, 220, 338 and 356 of\nCommission Delegated Regulation (EU) 2015/35 of 10 October 2014\nsupplementing Directive 2009/138/EC (hereinafter Commission Delegated\nRegulation 2015/35) [3] .\n\n\n1.3. These Guidelines are addressed to supervisory authorities under Solvency II.\n\n\n1.4. When calculating the Solvency Capital Requirement, undertakings may replace\na subset of parameters (standard parameters) within the standard formula by\nparameters specific to them, if the standard formula does not provide an\nappropriate representation of their underlying risks. This should help to\npromote sound risk management within insurance and reinsurance\nundertakings. \n\n\n\n### source 3 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 2: DIRECTIVES\n:\n\n extract:\n\n **DIRECTIVE 2009/138/EC OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL**\n\n\n**of 25 November 2009**\n\n\n**on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)**\n\n\n**(recast)**\n\n\n**(Text with EEA relevance)**\n\n\n\nTHE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EURO­\nPEAN UNION,\n\n\nHaving regard to the Treaty establishing the European Commu­\nnity, and in particular Article 47(2) and Article 55 thereof,\n\n\nHaving regard to the proposal from the Commission,\n\n\nHaving regard to the opinion of the European Economic and\nSocial Committee ( [1] ),\n\n\nAfter consulting the Committee of the Regions,\n\n\nActing in accordance with the procedure laid down in Article 251\nof the Treaty ( [2] ),\n\n\nWhereas: \n\n\n\n### source 4 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on reporting and public disclosure.pdf:\n\n extract:\n\n 1 Regulation (EU) No 1094/2010 of the European Parliament and of the Council of 24 November 2010\nestablishing a European Supervisory Authority (European Insurance and Occupational Pensions\nAuthority), amending Decision No 716/2009/EC and repealing Commission Decision 2009/79/EC (OJ L\n331, 15.12.2010, p. 48)\n2 Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the\ntaking-up and pursuit of the business of Insurance and Reinsurance (Solvency II) (OJ L 335, 17.12.2009,\np. 1)\n3 Commission Delegated Regulation (EU) 2015/35 of 10 October 2014 supplementing Directive/EC of the European Parliament and of the Council on the taking-up and pursuit of the business\nof Insurance and Reinsurance (Solvency II) (OJ L 12, 17.01.2015, p. 1)\n\n1.5. Unless otherwise stated, the Guidelines addressing individual undertakings\napply to individual insurance and reinsurance undertakings, to third country \n\n\n\n### source 5 \n\n metadata:\n * Title: guidelines-level-3: Guidelines on Own Risk Solvency Assessment .pdf:\n\n extract:\n\n **1.** **Introduction**\n\n\n1.1. According to Article 16 of Regulation (EU) No. 1094/2010 of the European\nParliament and of the Council of 24 November 2010 establishing a European\nSupervisory Authority (hereinafter “EIOPA Regulation”) [1,] EIOPA issues these\nGuidelines addressed to the supervisory authorities on how to proceed with the\napplication of Directive 2009/138/EC of the European Parliament and of the\nCouncil of 25 November 2009 on the taking-up and pursuit of the business of\ninsurance and reinsurance (hereinafter “Solvency II”) [2] .\n\n\n1.2. These Guidelines are based on Articles 41, 44, 45 and Article 246 of Solvency II\nand on Articles 262 and 306 of Commission Delegated Regulation (EU) 2015/35\nof 10 October 2014 supplementing Directive 2009/138/EC (hereinafter\n“Commission Delegated Regulation 2015/35”) [3] .\n\n\n1.3. Supervisory authorities are expected to ensure that undertakings take a\nforward looking view on the risks to which they are exposed. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Solvency II is the EU legislative framework established by **Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009** on the taking‑up and pursuit of the business of insurance and reinsurance. It sets out rules for insurers and reinsurers in the EU regarding capital requirements, risk management, and supervisory oversight, with the aim of ensuring their financial soundness and protecting policyholders. The framework is supplemented by **Commission Delegated Regulation (EU) 2015/35**, which provides detailed implementing measures (Source 3, Source 4, Source 5)."
        ]
    ]
}