
{
    "time": "Current time: 2025-10-03 14:09:44",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Welke SCR's/risico's moeten bepaald worden voor een ABS waarin hypotheken zitten? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER V*\n\n* Header 3: Section 6\n\n* Header 4: Subsection 1\n\n* Header 5: Article 189\n:\n\n extract:\n\n (d) the credit risk on mortgage loans which do not meet the requirements in Article 191(2) to (9).\n\n\n7. Investment guarantees on insurance contracts provided to policy holders by a third party and for which the\ninsurance or reinsurance undertaking would be liable should the third party default shall be treated as derivatives in the\ncounterparty default risk module. \n\n\n\n### source 2 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER III*\n\n* Header 3: Section 3\n\n* Header 4: Subsection 4\n\n* Header 5: Article 38\n:\n\n extract:\n\n (h) the assets are selected in such a way that they minimise the Solvency Capital Requirement for market risk that the\nreference undertaking is exposed to;\n\n\n(i) the Solvency Capital Requirement of the reference undertaking captures all of the following risks:\n\n\n(i) underwriting risk with respect to the transferred business,\n\n\n(ii) where it is material, the market risk referred to in point (h), other than interest rate risk,\n\n\n(iii) credit risk with respect to reinsurance contracts, arrangements with special purpose vehicles, intermediaries,\npolicyholders and any other material exposures which are closely related to the insurance and reinsurance\nobligations,\n\n\n(iv) operational risk;\n\n\n(j) the loss-absorbing capacity of technical provisions, referred to in Article 108 of Directive 2009/138/EC, in the\nreference undertaking corresponds for each risk to the loss-absorbing capacity of technical provisions in the original\nundertaking; \n\n\n\n### source 3 \n\n metadata:\n * Title: guidelines-level-3: EIOPA-BoS-14-259_Final report_ORSA.pdf\n* Header 1: **Final Report** **on** **Public Consultation No. 14/017 on** **Guidelines on** **own risk and solvency assessment**\n\n* Header 2: **Annex I: Guidelines**\n\n* Header 4: **Guideline 20 – Integration of related third-country insurance and re-**\n:\n\n extract:\n\n regulatory capital position. The undertaking is required to ensure that it can\nmeet the regulatory capital requirements in the form of the minimum capital\nrequirement (hereinafter \"MCR\") and the SCR.\n\n2.6. The undertaking is also expected to consider whether the SCR, calculated\n\nwith the standard formula or an internal model, would be appropriate\naccording to the undertaking’s risk profile.\n2.7. The ORSA may call for the performance of tasks that the undertaking has\n\nalready performed in a different context in which case no duplication of tasks\nis required but the result reached is to be taken into account in the ORSA.\n2.8. An undertaking’s assessment of its overall solvency needs does not \n\n\n\n### source 4 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER V*\n\n* Header 3: Section 5\n\n* Header 4: Subsection 5\n\n* Header 5: Article 177\n:\n\n extract:\n\n **Spread risk on securitisation positions: general provisions**\n\n\n1. The capital requirement _SCR_ _securitisation_ for spread risk on securitisation positions shall be the sum of a capital\nrequirement for type 1 securitisation positions, a capital requirement for type 2 securitisation positions and a capital\nrequirement for resecuritisation positions.\n\n2. Type 1 securitisation positions shall include securitisation positions that meet all of the following criteria:\n\n\n(a) the position has been assigned to credit quality step 3 or better;\n\n\n(b) the securitisation is listed in a regulated market of a country which is a member of the EEA or the OECD, or is\nadmitted to trading in an organised trading venue providing for an active and sizable market for outright sales\nwhich has the following features:\n\n\n(i) historical evidence of market breadth and depth as proven by low bid-ask spreads, high trading volume and a\nlarge number of market participants; \n\n\n\n### source 5 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER V*\n\n* Header 3: Section 6\n\n* Header 4: Subsection 1\n\n* Header 5: Article 197\n:\n\n extract:\n\n (a) the hypothetical capital requirement for market risk of the insurance or reinsurance undertaking that would apply if\nthe assets held as collateral were not included in the calculation;\n\n\n(b) the hypothetical capital requirement for market risk of the insurance or reinsurance undertaking that would apply if\nthe assets held as collateral were included in the calculation. \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte bronnen moeten de volgende SCR's (Solvency Capital Requirements) en risico's worden bepaald voor een Asset-Backed Security (ABS) die hypotheken bevat:\n\n1.  **Spreadrisico op securitisatieposities**: Er is een specifieke kapitaalvereiste voor het spreadrisico op securitisatieposities, genaamd `SCR_securitisation`. Deze vereiste is de som van de kapitaalvereisten voor type 1-securitisatieposities, type 2-securitisatieposities en hersecuritisatieposities (Source 4).\n\n2.  **Kredietrisico (Credit Risk)**: Het kredietrisico op de onderliggende hypotheken moet worden meegenomen. Dit valt onder de module voor het tegenpartijrisico (Source 1). De SCR moet in het algemeen het kredietrisico met betrekking tot verschillende blootstellingen omvatten (Source 2).\n\n3.  **Marktrisico (Market Risk)**: Naast het specifieke spreadrisico, dat een onderdeel is van het marktrisico, moet het algemene marktrisico worden vastgesteld. De SCR van een onderneming moet, waar materieel, het marktrisico omvatten (Source 2)."
        ]
    ]
}