
{
    "time": "Current time: 2025-10-03 13:24:30",
    "messages": [
        [
            "system",
            "You are an expert legal adviser on EU regulations, particularly Solvency II.\nIn case of formula's output in latex format with $, $$ dollar signs.\nIf none of the sources provided the answer, just say you don't know."
        ],
        [
            "user",
            "\n        ## Question\n        \n\n Een schadeverzekeraar heeft geplaats, maar nog niet gestort aandelenkapitaal. In welke tier valt dit kapitaal? \n\n\n        \n## Context\n        \n\n \n### source 1 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER IV*\n\n* Header 3: Section 2\n\n* Header 5: Article 79\n:\n\n extract:\n\n (d) where the undertaking is applying for classification as Tier 3 basic own funds, whether the basic own-fund item\npossesses the characteristics set out in Article 93(1)(b) of Directive 2009/138/EC, taking into consideration the\nfeatures set out in Article 93(2) of that Directive;\n\n\n(e) the legal enforceability of the contractual terms of the own-fund item in all relevant jurisdictions;\n\n\n(f) whether the own-fund item has been fully paid-in.\n\n\n3. Basic own-fund items not included in the list of own-fund items set out in Articles 69, 72 and 76 shall only be\nclassified as Tier 1 basic own funds where they are fully paid-in.\n\n\n4. The inclusion of own-fund items approved by the supervisory authority in accordance with this Article shall be\nsubject to quantitative limits set out in Article 82. \n\n\n\n### source 2 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER IV*\n\n* Header 3: Section 2\n\n* Header 5: Article 74\n:\n\n extract:\n\n **Tier 2 Ancillary own-funds — List of own-fund items**\n\n\nWithout prejudice to Article 96 of Directive 2009/138/EC, the following ancillary own-fund items shall be deemed to\nsubstantially possess the characteristics set out in Article 93(1)(b) of Directive 2009/138/EC, taking into consideration\nthe features set out in Article 93(2) of that Directive, and shall be classified as Tier 2, where the following items display\nall of the features set out in Article 75:\n\n\n(a) unpaid and uncalled ordinary share capital callable on demand;\n\n\n(b) unpaid and uncalled initial funds, members' contributions or the equivalent basic own-fund item for mutual and\nmutual-type undertakings, callable on demand;\n\n\n(c) unpaid and uncalled preference shares callable on demand;\n\n\n(d) a legally binding commitment to subscribe and pay for subordinated liabilities on demand; \n\n\n\n### source 3 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER IV*\n\n* Header 3: Section 2\n\n* Header 5: Article 69\n:\n\n extract:\n\n **Tier 1 — List of own-fund items**\n\n\nThe following basic own-fund items shall be deemed to substantially possess the characteristics set out in Article 93(1)(a)\nand (b) of Directive 2009/138/EC, taking into consideration the features set out in Article 93(2) of that Directive, and\nshall be classified as Tier 1, where those items display all of the features set out in Article 71:\n\n\n(a) the part of excess of assets over liabilities, valued in accordance with Article 75 and Section 2 of Chapter VI of\nDirective 2009/138/EC, comprising the following items:\n\n\n(i) paid-in ordinary share capital and the related share premium account;\n\n\n(ii) paid-in initial funds, members' contributions or the equivalent basic own-fund item for mutual and mutual-type\nundertakings;\n\n\n(iii) paid-in subordinated mutual member accounts;\n\n\n(iv) surplus funds that are not considered as insurance and reinsurance liabilities in accordance with Article 91(2) of\nDirective 2009/138/EC; \n\n\n\n### source 4 \n\n metadata:\n * Title: COMMISSION  DELEGATED  REGULATION  (EU)  2015/  35  -  of  10  October  2014  -  supplementing  Directive  2009/  138/  EC  of  the  European  Parliament  and  of  the  Council  on  the  taking-up  and  pursuit  of  the  business  of  Insurance  and  Reinsurance  (Solvency  II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER IV*\n\n* Header 3: Section 2\n\n* Header 5: Article 72\n:\n\n extract:\n\n **Tier 2 Basic own-funds — List of own-fund items**\n\n\nThe following basic own-fund items shall be deemed to substantially possess the characteristics set out in\nArticle 93(1)(b) of Directive 2009/138/EC, taking into consideration the features set out in Article 93(2) of that\nDirective, and shall be classified as Tier 2 where the following items display all of the features set out in Article 73:\n\n\n(a) the part excess of assets over liabilities, valued in accordance with Article 75 and Section 2 of Chapter VI of\nDirective 2009/138/EC, comprising the following items:\n\n\n(i) ordinary share capital and the related share premium account;\n\n\n(ii) initial funds, members' contributions or the equivalent basic own-fund item for mutual and mutual-type\nundertakings;\n\n\n(iii) subordinated mutual member accounts;\n\n\n(iv) preference shares and the related share premium account;\n\n\n(b) subordinated liabilities valued in accordance with Article 75 of Directive 2009/138/EC. \n\n\n\n### source 5 \n\n metadata:\n * Title: Directive 2009/138/EC of the European Parliament and of the Council of 25 November 2009 on the taking-up and pursuit of the business of Insurance and Reinsurance (Solvency II)\n* Header 1: TITLE I\n\n* Header 2: *CHAPTER VI*\n\n* Header 3: Section 3\n\n* Header 4: Subsection 2\n\n* Header 5: Article 93\n:\n\n extract:\n\n **Characteristics and features used to classify own funds**\n**into tiers**\n\n\n1. Own-fund items shall be classified into three tiers. The clas­\nsification of those items shall depend upon whether they are basic\nown fund or ancillary own-fund items and the extent to which\nthey possess the following characteristics:\n\n\n(a) the item is available, or can be called up on demand, to fully\nabsorb losses on a going-concern basis, as well as in the case\nof winding-up (permanent availability);\n\n\n(b) in the case of winding-up, the total amount of the item is\navailable to absorb losses and the repayment of the item is\nrefused to its holder until all other obligations, including\ninsurance and reinsurance obligations towards policy hold­\ners and beneficiaries of insurance and reinsurance contracts,\nhave been met (subordination). \n\n\n \n\n\n        \n## Answer\n        \n\n When answering reference ONLY if applicable source with (Source <insert number>). Answer based on the mentioned sources in the Context answer the Question. \n        \n\n\n        "
        ],
        [
            "assistant",
            "Op basis van de verstrekte bronnen valt geplaatst, maar nog niet gestort aandelenkapitaal onder Tier 2.\n\nDit kapitaal wordt beschouwd als een \"ancillary own-fund item\" (aanvullend eigen-vermogensbestanddeel). Volgens artikel 74 van de Gedelegeerde Verordening (EU) 2015/35 wordt \"unpaid and uncalled ordinary share capital callable on demand\" (niet-gestort en niet-opgevraagd gewoon aandelenkapitaal dat op aanvraag opvraagbaar is) geclassificeerd als Tier 2 (Source 2).\n\nTer verduidelijking, voor classificatie in Tier 1 is het vereist dat het aandelenkapitaal volledig is volgestort (\"paid-in\") (Source 3, Artikel 69(a)(i) en Source 1, Artikel 79(3)). Aangezien het kapitaal in de vraag nog niet is gestort, kan het niet als Tier 1 worden geclassificeerd."
        ]
    ]
}